In [1]:
%load_ext sql

In [2]:
%sql sqlite:///AuctionBase.db

'Connected: None@AuctionBase.db'

In [3]:
%sql select * from Users limit 4;

Done.

[('!peanut', 37, 'Arkansas', 'USA'),
 ('$303', 534, 'merlin', 'USA'),
 ('$4bob', 2747, 'Ash Flat, AR.', 'USA'),
 ('$9.99', 204, 'PAYPAL OK', 'USA')]

In [4]:
%sql select * from Bids limit 4;

Done.

[('$4bob', 1496021639, '2001-12-15 22:30:32', 4.86),
 ('$4bob', 1676049878, '2001-12-10 06:22:03', 6.33),
 ('$4bob', 1677024023, '2001-12-13 20:23:06', 22.5),
 ('$9.99warehouse', 1309373684, '2001-12-15 01:30:03', 37.5)]

In [28]:
%%sql 
SELECT COUNT(*) 
FROM Users;

Done.

[(13422,)]

In [29]:
%%sql 
SELECT COUNT(*)
FROM Users
WHERE Location = 'New York';

Done.

[(80,)]

In [30]:
%%sql
SELECT COUNT(*)
FROM (
  SELECT ItemID
  FROM Category
  GROUP BY ItemID
  HAVING COUNT(Category) = 4
);

Done.

[(8365,)]

In [32]:
%%sql 
SELECT ItemID
FROM Items
WHERE Currently = (
    SELECT MAX(Currently)
    FROM Items
);

Done.

[(1046871451,)]

In [33]:
%%sql
SELECT COUNT(*)
FROM (
    SELECT DISTINCT Users.UserID, Users.Rating
    FROM Users, Items
    WHERE Users.UserID = Items.SellerID
    AND Users.Rating > 1000
);

Done.

[(3130,)]

In [36]:
%%sql
SELECT COUNT(*)
FROM (
    SELECT DISTINCT Bids.UserID
    FROM Bids, Items
    WHERE Bids.UserID = Items.SellerID
);

Done.

[(6717,)]

In [37]:
%%sql
SELECT COUNT(*)
FROM (
    SELECT DISTINCT Category.Category
    FROM Category, Bids
    WHERE Category.ItemID = Bids.ItemID
    AND Bids.Amount > 100
);

Done.

[(150,)]